strid3r21/smartbeedesigns/SBD/hardware/SBD/1.0.0/boards.txt
Bee_Motion.menu.DFUOnBoot.default=Disabled
Bee_Motion.menu.DFUOnBoot.default.build.dfu_on_boot=0
Bee_Motion.menu.DFUOnBoot.dfu=Enabled
Bee_Motion.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

Bee_Motion.menu.USBMode.default=USB-OTG
Bee_Motion.menu.USBMode.default.build.usb_mode=0
Bee_Motion.menu.USBMode.default.upload.use_1200bps_touch=true
Bee_Motion.menu.USBMode.default.upload.wait_for_upload_port=true
Bee_Motion.menu.USBMode.hwcdc=Hardware CDC and JTAG
Bee_Motion.menu.USBMode.hwcdc.build.usb_mode=1
Bee_Motion.menu.USBMode.hwcdc.upload.use_1200bps_touch=false
Bee_Motion.menu.USBMode.hwcdc.upload.wait_for_upload_port=false

Bee_Motion.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Bee_Motion.menu.PartitionScheme.default.build.partitions=default
Bee_Motion.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Bee_Motion.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Bee_Motion.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Bee_Motion.menu.PartitionScheme.no_ota.build.partitions=no_ota
Bee_Motion.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Bee_Motion.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Bee_Motion.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Bee_Motion.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Bee_Motion.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Bee_Motion.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Bee_Motion.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Bee_Motion.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Bee_Motion.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Bee_Motion.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Bee_Motion.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Bee_Motion.menu.PartitionScheme.huge_app.build.partitions=huge_app
Bee_Motion.menu.PartitionScheme.huge_app.upload.maximum_size=3145728

Bee_Motion.menu.DebugLevel.none=None
Bee_Motion.menu.DebugLevel.none.build.code_debug=0
Bee_Motion.menu.DebugLevel.error=Error
Bee_Motion.menu.DebugLevel.error.build.code_debug=1
Bee_Motion.menu.DebugLevel.warn=Warn
Bee_Motion.menu.DebugLevel.warn.build.code_debug=2
Bee_Motion.menu.DebugLevel.info=Info
Bee_Motion.menu.DebugLevel.info.build.code_debug=3
Bee_Motion.menu.DebugLevel.debug=Debug
Bee_Motion.menu.DebugLevel.debug.build.code_debug=4
Bee_Motion.menu.DebugLevel.verbose=Verbose
Bee_Motion.menu.DebugLevel.verbose.build.code_debug=5

Bee_Motion.menu.EraseFlash.none=Disabled
Bee_Motion.menu.EraseFlash.none.upload.erase_cmd=
Bee_Motion.menu.EraseFlash.all=Enabled
Bee_Motion.menu.EraseFlash.all.upload.erase_cmd=-e

#####################################################################

Bee_Motion_Mini.name=Bee Motion Mini

Bee_Motion_Mini.bootloader.tool=esptool_py
Bee_Motion_Mini.bootloader.tool.default=esptool_py

Bee_Motion_Mini.upload.tool=esptool_py
Bee_Motion_Mini.upload.tool.default=esptool_py
Bee_Motion_Mini.upload.tool.network=esp_ota

Bee_Motion_Mini.upload.maximum_size=1310720
Bee_Motion_Mini.upload.maximum_data_size=327680
Bee_Motion_Mini.upload.flags=
Bee_Motion_Mini.upload.extra_flags=
Bee_Motion_Mini.upload.use_1200bps_touch=false
Bee_Motion_Mini.upload.wait_for_upload_port=false

Bee_Motion_Mini.serial.disableDTR=true
Bee_Motion_Mini.serial.disableRTS=true

Bee_Motion_Mini.build.tarch=riscv32
Bee_Motion_Mini.build.target=esp
Bee_Motion_Mini.build.mcu=esp32c3
Bee_Motion_Mini.build.core=esp32
Bee_Motion_Mini.build.variant=Bee_Motion_Mini
Bee_Motion_Mini.build.board=Bee_Motion_Mini
Bee_Motion_Mini.build.bootloader_addr=0x0

Bee_Motion_Mini.build.cdc_on_boot=1
Bee_Motion_Mini.build.f_cpu=160000000L
Bee_Motion_Mini.build.flash_size=4MB
Bee_Motion_Mini.build.flash_freq=80m
Bee_Motion_Mini.build.flash_mode=dio
Bee_Motion_Mini.build.boot=qio
Bee_Motion_Mini.build.partitions=default
Bee_Motion_Mini.build.defines=

Bee_Motion_Mini.menu.CDCOnBoot.default=Enabled
Bee_Motion_Mini.menu.CDCOnBoot.default.build.cdc_on_boot=1
Bee_Motion_Mini.menu.CDCOnBoot.dis_cdc=Disabled
Bee_Motion_Mini.menu.CDCOnBoot.dis_cdc.build.cdc_on_boot=0

Bee_Motion_Mini.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Bee_Motion_Mini.menu.PartitionScheme.default.build.partitions=default
Bee_Motion_Mini.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Bee_Motion_Mini.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Bee_Motion_Mini.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Bee_Motion_Mini.menu.PartitionScheme.no_ota.build.partitions=no_ota
Bee_Motion_Mini.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Bee_Motion_Mini.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Bee_Motion_Mini.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Bee_Motion_Mini.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Bee_Motion_Mini.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Bee_Motion_Mini.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Bee_Motion_Mini.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Bee_Motion_Mini.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Bee_Motion_Mini.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Bee_Motion_Mini.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Bee_Motion_Mini.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Bee_Motion_Mini.menu.PartitionScheme.huge_app.build.partitions=huge_app
Bee_Motion_Mini.menu.PartitionScheme.huge_app.upload.maximum_size=3145728

Bee_Motion_Mini.menu.CPUFreq.160=160MHz (WiFi)
Bee_Motion_Mini.menu.CPUFreq.160.build.f_cpu=160000000L
Bee_Motion_Mini.menu.CPUFreq.80=80MHz (WiFi)
Bee_Motion_Mini.menu.CPUFreq.80.build.f_cpu=80000000L
Bee_Motion_Mini.menu.CPUFreq.40=40MHz
Bee_Motion_Mini.menu.CPUFreq.40.build.f_cpu=40000000L
Bee_Motion_Mini.menu.CPUFreq.20=20MHz
Bee_Motion_Mini.menu.CPUFreq.20.build.f_cpu=20000000L
Bee_Motion_Mini.menu.CPUFreq.10=10MHz
Bee_Motion_Mini.menu.CPUFreq.10.build.f_cpu=10000000L

